Sergio5714/wulpus-pro/fw/esp32/sdkconfig.defaults.esp32c6
CONFIG_IDF_TARGET="esp32c6"

CONFIG_BSP_LED_PIN=8

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y

CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=20
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=40
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=128
CONFIG_ESP32_WIFI_RX_BA_WIN=32
CONFIG_ESP32_WIFI_TX_BA_WIN=64

CONFIG_LWIP_TCP_SND_BUF_DEFAULT=40000
CONFIG_LWIP_TCP_WND_DEFAULT=40000
CONFIG_LWIP_UDP_RECVMBOX_SIZE=16
